package javabasic.interface_study.interfaceintroduct;

/**
 * 接口概述与举例
 *
 *   生活中的接口举例
 *      电源插座当中的电源接口
 *               这个电源接口全中国大陆地区长的都是一样的  叫做国标  不管你是打印机也好  电脑也好  小风扇啊  一般的加用电器都可以使用这样的电源接口
 *               那它是怎么做到的  这是一套全国加统一的规范标准
 *      接口就是一种【公共的规范标准】
 *               举例：仔细想一下你  你去买一个家用电器的时候 你什么时候出现过  我买了一个联想的电脑 回来以后发现哪个插头不能用  没有这个现象  ，这就是公共规范标准
 *                     香港或者国外 这个标准不一样     你是电视是吧  电视厂商在生产的时候 我就按照这个规范走  那你插线板也是工厂做出来的  这个工厂也按照规范走 所以这样大家就都能通用
 *
 *                     只要符合规范标准 就可以大家通用 ，这种通用就是接口最大的意义所在
 *
 *                举例： 有两台笔记本电脑  苹果电脑和联想电脑
 *                             对于不一样的笔记本电脑厂商来说 这两台电脑之间想互相之间传数据  假如需要用U盘拷贝资料  这个U盘在苹果电脑上可以用
 *                             在联想电脑上可以用  在你的电脑上也能用  神奇了  这大家怎么都就统一了呢  因为中间有一个接口(usb接口)
 *                             那苹果电脑上面有没有这样的接口呢  有
 *                             那联想电脑上面有没有这个接口呢   也有  这就是广为人知  比比皆是的USB接口  那借助这样的接口 苹果电脑 联想电脑  戴尔电脑
 *                             都可以通过U盘来互相之间拷贝资料  那其实不光有u盘 只要是符合标准 各种USB设备都可以进行使用
 *
 *                             即 ： 只要符合USB接口的规范
 *                                   那么各种设备都可以使用
 *                                               例： U盘  打印机  夜读灯  usb小风扇.....这些厂商  你琢磨一下  它们在制造U盘  制造打印机
 *                                                    造这些小风扇的时候 有没有跟苹果公司商量一下  商量了吗  没商量  那么跟联想它们家商量了吗   也不商量
 *                                                    我就只管做我自己的  那它是如何保证你做完了以后大家都能用的呢
 *                                                    这就在于公共的规范标准 谁呢  usb接口  是由inter公司提出的一套公共规范
 *                                                    它就要求这个规范当中说了电脑都得有usb母口  而你这些设备都得有usb公口
 *                                                    正是有了usb规范 所以这么样千奇百怪得设备才可以统一规范使用  这就是接口为我们所带来得便利性
 *
 *
 *
 */
public class DemoMain {
}
